{
    "books": [
        {
            "title": "Kafka on the Shore",
            "author": "Haruki Murakami",
            "genre": "Fiction",
            "year": 2002,
            "read_on": "December 5 - 15 2024",
            "review": "This is my first book from Haruki Murakami and I haven't even read anything about Franz Kafka yet so I thought this might be challenging a bit. I loved the alternating turn in between chapters, it helped in building momentum. If it was focused on one character, it'd be just boring and confusing. Albeit I ended up having so many questions about the novel. Upon further research, it's actually a magical realism and that the story is subject to interpretation. While it was tiring to find relevant theories in Reddit after, one thing is for sure: the story is creatively written. I was immersed in Kafka's world, and while I do not fully understand the reason why things came to be, I did enjoy the experience. Me not understanding the book fully is not the typical \"I hate this book, I didn't understand anything!\" It's more of a \"I love this book, everything's confusing but fascinating at the same time!\". I am not a fan of metaphysics but the novel made me feel and appreciate it."
        },
        {
            "title": "Before The Coffee Gets Cold",
            "author": "Toshikazu Kawaguchi",
            "genre": "Fiction",
            "year": 2015,
            "read_on": "November 28 - December 1 2024",
            "review": "The book is a light read; I enjoyed the short separate chapters that left me inspired and hopeful what happens next. As someone who dwells in nostalgia and the idea of going back in time -- not to change anything, but to experience it once more -- the book gave me perspective on dealing with such matters. The climax of every chapter is a tear-jerker!"
        },
        {
            "title": "The Lost World",
            "author": "Sir Arthur Conan Doyle",
            "genre": "Fiction",
            "year": 1912,
            "read_on": "2024",
            "review": "I am not sure if I read this book this year or last year (blame iTunes for ruining my storage!) but I remember enjoying the fantasy and adventure in this book. I'm always a fan of pre-historic animals, and this book gave me a glimpse of what it's like to live in a world where dinosaurs still exist. I sensed a bit of racism in the book considering it was written last century, but yeah, it's a good read! The idea that there exists creatures we thought were gone a long time ago in such a remote place is not so unlikely -- I mean, latest articles about LIDAR and undiscovered places just being discovered now strengthen the possibility that they still exist!"
        },
        {
            "title": "The Phoenix Project",
            "author": "Gene Kim, Kevin Behr, George Spafford",
            "genre": "Fiction",
            "year": 2013,
            "read_on": "January 2024",
            "review": "Will re-read this one. It's a great book if you need to see how IT operations is managed in the eyes of an IT leader."
        },
        {
            "title": "The Deadline",
            "author": "Tom DeMarco",
            "genre": "Fiction",
            "year": 1997,
            "read_on": "2022",
            "review": "I've read this one as part of our academic requirements. This is a nice book to read if you're interested in project management and leading teams! Not related to the book: reading this gave me a boost in confidence that I can actually read and finish a book! That's why I made a 'books' section to keep that reading habit going. Will re-read this again!"
        }
    ]
}
