{
    "books": [
        {
            "title": "Beasts of a Little Land",
            "author": "Juhea Kim",
            "genre": "Historical Fiction",
            "year": 2021,
            "read_on": "March 06 2025",
            "review": "Learned about this book on a book fair on a random day in Glorietta-Landmark, and I was captivated by the art in the cover. Interestingly, I could only notice that it might be the last copy on display. All I thought based on the cover only was that this might be magical historical fantasy/mythology a la Fantastic Beasts. Alas, I was mistaken and I was not prepared for what's going to hit me when I read this book. The fact that this is a debut novel blows my mind! I was immersed in the book as if I'm living through imperial occupation in Korea. And this book is one of the first books that I've read that just made me feel devastated -- expectedly so. You ever read or watched something and hope for the 'good' plot twist at the end but a tiny part of you actually hopes it goes sideways because, where's the thrill if that the 'inyeon' that you're expecting happens?! Only this time that heartbreaking thing really happened and it broke me apart and regrettably hoped for a happy ending. One thing is for sure -- in such destructive turmoils like wars, you can't really expect everyone having a happy ending and I'm pretty sure the novel won't be as good if it goes the expected happy ending way for a historical fiction. Also, I hated HanChol along with the Japanese imperialists! P.S. I thought heartbreaks stop at K-Dramas, but oh boy!"
        },
        {
            "title": "The Code Book",
            "author": "Simon Singh",
            "genre": "Non-fiction",
            "year": 2000,
            "read_on": "January 16 2025",
            "review": "First book for 2025, and I am already loving it! 66766666 67206167 64666120 66616764 64207661 67646420 78616664 66206164 64616720 76666761 61206776 66767820 66766464 64206161 78647820 64786164 61207861 61667620 66616766 64206464 66666620 61666161 64206476 66676720 78667866 61206476 67666620 66667666 78206461 61616420 78616764 64206761 61766120 76616678 61206664 67617820 61676666 67207861 67646720 66616161 61206176 66666620 66667661 61206766 67646420 66616161 61206464 66616420 64767866 66207864 64667620 61766478 662064... until I read this book! The Navajo code talkers amazed me the most, while the quantum chapter tickled my mind the most. This is a fascinating, light, introductory read on the history (and future) of cryptography. I have yet to start the cipher challenge though. One insightful lesson I learned about this book is that one should be 67786164 66206167 66676120 61676166 782067 about something if they want to pursue something great. Buying this second-hand book was definitely worth it! Note: key is somewhere around in this entry."
        },
        {
            "title": "Kafka on the Shore",
            "author": "Haruki Murakami",
            "genre": "Fiction",
            "year": 2002,
            "read_on": "December 5 - 15 2024",
            "review": "This is my first book from Haruki Murakami and I haven't even read anything about Franz Kafka yet so I thought this might be challenging a bit. I loved the alternating turn in between chapters, it helped in building momentum. If it was focused on one character, it'd be just boring and confusing. Albeit I ended up having so many questions about the novel. Upon further research, it's actually a magical realism and that the story is subject to interpretation. While it was tiring to find relevant theories in Reddit after, one thing is for sure: the story is creatively written. I was immersed in Kafka's world, and while I do not fully understand the reason why things came to be, I did enjoy the experience. Me not understanding the book fully is not the typical \"I hate this book, I didn't understand anything!\" It's more of a \"I love this book, everything's confusing but fascinating at the same time!\". I am not a fan of metaphysics but the novel made me feel and appreciate it. Not the Oedipal theme though -- that's just disgustinGGG. Oh and yes, I liked Archduke Trio!"
        },
        {
            "title": "Before The Coffee Gets Cold",
            "author": "Toshikazu Kawaguchi",
            "genre": "Fiction",
            "year": 2015,
            "read_on": "November 28 - December 1 2024",
            "review": "The book is a light read; I enjoyed the short separate chapters that left me inspired and hopeful what happens next. As someone who dwells in nostalgia and the idea of going back in time -- not to change anything, but to experience it once more -- the book gave me perspective on dealing with such matters. The climax of every chapter is a tear-jerker!"
        },
        {
            "title": "The Lost World",
            "author": "Sir Arthur Conan Doyle",
            "genre": "Fiction",
            "year": 1912,
            "read_on": "2024",
            "review": "I am not sure if I read this book this year or last year (blame iTunes for ruining my storage!) but I remember enjoying the fantasy and adventure in this book. I'm always a fan of pre-historic animals, and this book gave me a glimpse of what it's like to live in a world where dinosaurs still exist. I sensed a bit of racism in the book considering it was written last century, but yeah, it's a good read! The idea that there exists creatures we thought were gone a long time ago in such a remote place is not so unlikely -- I mean, latest articles about LIDAR and undiscovered places just being discovered now strengthen the possibility that they still exist!"
        },
        {
            "title": "The Phoenix Project",
            "author": "Gene Kim, Kevin Behr, George Spafford",
            "genre": "Fiction",
            "year": 2013,
            "read_on": "January 2024",
            "review": "Will re-read this one. It's a great book if you need to see how IT operations is managed in the eyes of an IT leader."
        },
        {
            "title": "The Deadline",
            "author": "Tom DeMarco",
            "genre": "Fiction",
            "year": 1997,
            "read_on": "2022",
            "review": "I've read this one as part of our academic requirements. This is a nice book to read if you're interested in project management and leading teams! Not related to the book: reading this gave me a boost in confidence that I can actually read and finish a book! That's why I made a 'books' section to keep that reading habit going. Will re-read this again!"
        }
    ]
}
